TurbulanceModels-flat-plate/Spalart-Allmaras_boundary_layer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }

    plate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }
    front
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
