TurbulanceModels-flat-plate/Spalart-Allmaras_boundary_layer/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-04;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 1e-04;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 1e-04;
    }

    plate
    {
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        type            freestream;
        freestreamValue uniform 1e-04;
    }

    front
    {
        type            symmetryPlane;
        freestreamValue uniform 1e-04;
    }
}

// ************************************************************************* //
